neuropraxpy/octave/mingw64/share/man/man8/paperconfig.8
.\" paperconfig.8, Copyright (C) 1996, Yves Arrouye <arrouye@debian.org>
.TH PAPERCONFIG 8 "5 January 2005" "Debian/Linux" "Linux Administrator's Manual"
.SH NAME
.B paperconfig
\- configure the system default paper size
.SH SYNOPSIS
.B paperconfig
[
.BR \-v\fP, \fB\-\-version
]
[
.BR \-h\fP, \fB\-\-help
]
[
.BI "\-p\fP, \fB\-\-paper" " papername"
|
.B \-\-force
]
.SH DESCRIPTION
.B paperconfig
sets the system (or default) paper to be used by tools using the
.B papersize
file.
It can either ask interactively for the paper to use or be called
non-interactively by scripts.
.PP
When the paper size has been changed,
.B paperconfig
notifies other packages of the change by running the scripts in the
.I ${prefix}/etc/libpaper.d
directory.
.SH OPTIONS
.TP
.BR \-v\fP, \fB\-\-version
Print the version of
.B paperconfig
and exit.
.TP
.BR \-h\fP, \fB\-\-help
Print help about usage and exit.
.TP
.BI "\-p\fP, \fB\-\-paper" " papername"
Use
.I papername
if possible. If
.I papername
is not a valid paper, print an error message and exit.
.TP
.B \-\-force
Force interactive selection of the system paper even if the actual paper
is a valid one.
.SH ENVIRONMENT
.B PAPERCONF
Full path to a file containing the paper size to use; this file will
be rewritten with the system paper size.
.SH FILES
.TP 20
.B ${prefix}/etc/papersize
Contains the name of the system-wide default paper size to be used
if the
.B PAPERSIZE
variable is not set.
.TP 20
.B ${prefix}/etc/libpaper.d
Directory of scripts to run after the paper size has been changed.
This package puts no scripts here, but other packages may.
.B run-parts
is used to run the scripts, therefore their names must comply with 
.B run-part's
naming requirements.
.SH AUTHOR
Yves Arrouye <arrouye@debian.org>
.SH SEE ALSO
.BR paperconf (1)
.br
.BR papersize (5)

